index.org
#+TITLE: clang-tags
#+STYLE: <link type="text/css" href="worg.css" title="Standard" rel="stylesheet">
#+STYLE: <link type="text/css" href="worg-zenburn.css" title="Zenburn" rel="alternate stylesheet">
#+STYLE: <link type="text/css" href="worg-classic.css" title="Classic" rel="alternate stylesheet">
#+STYLE: <style type="text/css">
#+STYLE:   #text-1 pre.src { float: left; margin-right: 3em }
#+STYLE:   #sec-1-1 { clear: both; }
#+STYLE: </style>
#+BIND: org-export-html-postamble "Generated by %c using CSS stylesheets from <a href='http://www.orgmode.org/worg'>Worg</a>."
#+OPTIONS: author:nil timestamp:nil level:4 toc:2

=clang-tags= is a C / C++ source code indexing tool. Unlike many other indexing
tools, =clang-tags= relies on the [[http://clang.llvm.org][clang]] compiler (via
the libclang interface) to analyse and index the source code base.


* Introduction

  Let us consider the following C++ code:

  #+NAME: example
  #+begin_src c++ -n -r
    #include "config.h"
    #include <iostream>
    
    #ifdef DEBUG
    inline void debug (const char* message) { (ref:debug1)
      std::cerr << message << std::endl;
    }
    #else
    inline void debug (const char* message) {(ref:debug2)}
    #endif
    
    template <typename T> struct MyClass {
      MyClass () { debug ("MyClass::MyClass"); (ref:defCtor) }
    
      void display () { (ref:defDisplayT)
        std::cout << "MyClass<T>::display()" << std::endl;
      }
    };
    
    template <> struct MyClass<int> {
      void display () { (ref:defDisplayInt)
        std::cout << "MyClass<int>::display()" << std::endl;
      }
    };
    
    int main () {
      int display = 3; (ref:display1)
    
      MyClass<double> a; (ref:ctor)
      a.display(); (ref:display2)
    
      MyClass<int> b;
      b.display(); (ref:display3)
    }
  #+end_src

  A few difficulties can be found in this file, making indexing difficult without the help of a
  full-fledged C++ compiler:

  1. Depending on the =DEBUG= preprocessor macro, the definition of the function =debug= might be found
     at line [[(debug1)]] or [[(debug2)]].

  2. The =display= identifier is used in several places to mean widely different things (for example
     at lines [[(display1)]] and [[(display2)]]). Context information is necessary to disambiguate uses of
     the same identifier.

  3. Even when =display= refers to the method of template class =MyClass<>=, a precise knowledge of the
     complex C++ template specialization rules is required to associate [[(display2)][a.display()]] with
     [[(defDisplayT)][MyClass<T>::display()]] and [[(display3)][b.display()]] with [[(defDisplayInt)][MyClass<int>::display()]].

  4. Some functions such as constructors or operators can be called without explicitly appearing in
     the code. For example, the [[(defCtor)][MyClass::MyClass()]] constructor is called at line [[(ctor)]].


  On the other hand, using a C++ compiler such as =clang= to parse this code and generate an AST
  requires information about the project configuration and its build environment:

  1. The =config.h= file could be automatically generated by =autoconf= or =CMake= and reside in a
     completely different directory than other source files. The compiler will typically need to be
     provided with =-I= command-line arguments to know where to find header files.

  2. The =DEBUG= macro could well be defined by the compilation command line (typically using a =-D=
     switch).

  A compiler-based indexing tool thus needs to be aware of the full compilation commands which are
  used to build the project, including for each source file:
  - the full list of command-line switches,
  - the directory from which the file is compiled.

  Such information, which we will refer to as a "compilation database" in the following, is usually
  found in the build system configuration, which can take a wide variety of forms: hand-crafted
  =Makefile=, =autotools= project, =CMake= project, /etc./

** Features

   =clang-tags= aims at providing the following features:
   1. generate a compilation database in a build-system-agnostic way,
   2. index the sources of the project,
   3. use this index to provide IDE-like features in Emacs.


