index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>clang-tags</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="clang-tags"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-07T23:09+0100"/>
<meta name="author" content="François Févotte"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link type="text/css" href="worg.css" title="Standard" rel="stylesheet">
<link type="text/css" href="worg-zenburn.css" title="Zenburn" rel="alternate stylesheet">
<link type="text/css" href="worg-classic.css" title="Classic" rel="alternate stylesheet">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">clang-tags</h1>

<p><code>clang-tags</code> is a C / C++ source code indexing tool. Unlike many other indexing
tools, <code>clang-tags</code> relies on the <a href="http://clang.llvm.org">clang</a> compiler (via
the libclang interface) to analyse and index the source code base.
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1 Features</a></li>
<li><a href="#sec-1-2">1.2 First steps for the impatient</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Creating the compilation database</a>
<ul>
<li><a href="#sec-2-1">2.1 From a <code>CMake</code> project</a></li>
<li><a href="#sec-2-2">2.2 Tracing the standard build process</a></li>
<li><a href="#sec-2-3">2.3 Scanning the sources directory</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Indexing the source files</a>
<ul>
<li><a href="#sec-3-1">3.1 Creating the index</a></li>
<li><a href="#sec-3-2">3.2 Updating the index</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Using the Emacs UI</a>
<ul>
<li><a href="#sec-4-1">4.1 Find the definition of the symbol at point</a></li>
<li><a href="#sec-4-2">4.2 Find all uses of a definition in the source base</a></li>
</ul>
</li>
<li><a href="#sec-5">5 See also</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  Let us consider the following C++ code:
</p>



<pre class="src src-c++"><span class="linenr"> 1:  </span><span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">"config.h"</span>
<span class="linenr"> 2:  </span><span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span><span style="color: #7a378b;">#ifdef</span> DEBUG
<span id="coderef-debug1" class="coderef-off"><span class="linenr"> 5:  </span><span style="color: #a020f0;">inline</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">debug</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">message</span>) {</span>
<span class="linenr"> 6:  </span>  <span style="color: #008b8b;">std</span>::cerr &lt;&lt; message &lt;&lt; <span style="color: #008b8b;">std</span>::endl;
<span class="linenr"> 7:  </span>}
<span class="linenr"> 8:  </span><span style="color: #7a378b;">#else</span>
<span id="coderef-debug2" class="coderef-off"><span class="linenr"> 9:  </span><span style="color: #a020f0;">inline</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">debug</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">message</span>) {}</span>
<span class="linenr">10:  </span><span style="color: #7a378b;">#endif</span>
<span class="linenr">11:  </span>
<span class="linenr">12:  </span><span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt; <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">MyClass</span> {
<span id="coderef-defCtor" class="coderef-off"><span class="linenr">13:  </span>  <span style="color: #0000ff;">MyClass</span> () { debug (<span style="color: #8b2252;">"MyClass::MyClass"</span>); }</span>
<span class="linenr">14:  </span>
<span id="coderef-defDisplayT" class="coderef-off"><span class="linenr">15:  </span>  <span style="color: #228b22;">void</span> <span style="color: #0000ff;">display</span> () {</span>
<span class="linenr">16:  </span>    <span style="color: #008b8b;">std</span>::cout &lt;&lt; <span style="color: #8b2252;">"MyClass&lt;T&gt;::display()"</span> &lt;&lt; <span style="color: #008b8b;">std</span>::endl;
<span class="linenr">17:  </span>  }
<span class="linenr">18:  </span>};
<span class="linenr">19:  </span>
<span class="linenr">20:  </span><span style="color: #a020f0;">template</span> &lt;&gt; <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>&gt; {
<span id="coderef-defDisplayInt" class="coderef-off"><span class="linenr">21:  </span>  <span style="color: #228b22;">void</span> <span style="color: #0000ff;">display</span> () {</span>
<span class="linenr">22:  </span>    <span style="color: #008b8b;">std</span>::cout &lt;&lt; <span style="color: #8b2252;">"MyClass&lt;int&gt;::display()"</span> &lt;&lt; <span style="color: #008b8b;">std</span>::endl;
<span class="linenr">23:  </span>  }
<span class="linenr">24:  </span>};
<span class="linenr">25:  </span>
<span class="linenr">26:  </span><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span> () {
<span id="coderef-display1" class="coderef-off"><span class="linenr">27:  </span>  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">display</span> = 3;</span>
<span class="linenr">28:  </span>
<span id="coderef-ctor" class="coderef-off"><span class="linenr">29:  </span>  <span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">double</span>&gt; <span style="color: #a0522d;">a</span>;</span>
<span id="coderef-display2" class="coderef-off"><span class="linenr">30:  </span>  a.display();</span>
<span class="linenr">31:  </span>
<span class="linenr">32:  </span>  <span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">b</span>;
<span id="coderef-display3" class="coderef-off"><span class="linenr">33:  </span>  b.display();</span>
<span class="linenr">34:  </span>}
</pre>


<p>
  A few difficulties can be found in this file, making indexing difficult without the help of a
  full-fledged C++ compiler:
</p>
<ol>
<li>Depending on the <code>DEBUG</code> preprocessor macro, the definition of the function <code>debug</code> might be found
     at line <a href="#coderef-debug1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-debug1');" onmouseout="CodeHighlightOff(this, 'coderef-debug1');">5</a> or <a href="#coderef-debug2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-debug2');" onmouseout="CodeHighlightOff(this, 'coderef-debug2');">9</a>.

</li>
<li>The <code>display</code> identifier is used in several places to mean widely different things (for example
     at lines <a href="#coderef-display1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-display1');" onmouseout="CodeHighlightOff(this, 'coderef-display1');">27</a> and <a href="#coderef-display2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-display2');" onmouseout="CodeHighlightOff(this, 'coderef-display2');">30</a>). Context information is necessary to disambiguate uses of
     the same identifier.

</li>
<li>Even when <code>display</code> refers to the method of template class <code>MyClass&lt;&gt;</code>, a precise knowledge of the
     complex C++ template specialization rules is required to associate <a href="#coderef-display2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-display2');" onmouseout="CodeHighlightOff(this, 'coderef-display2');">a.display()</a> with
     <a href="#coderef-defDisplayT" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defDisplayT');" onmouseout="CodeHighlightOff(this, 'coderef-defDisplayT');">MyClass&lt;T&gt;::display()</a> and <a href="#coderef-display3" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-display3');" onmouseout="CodeHighlightOff(this, 'coderef-display3');">b.display()</a> with <a href="#coderef-defDisplayInt" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defDisplayInt');" onmouseout="CodeHighlightOff(this, 'coderef-defDisplayInt');">MyClass&lt;int&gt;::display()</a>.

</li>
<li>Some functions such as constructors or operators can be called without explicitly appearing in
     the code. For example, the <a href="#coderef-defCtor" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defCtor');" onmouseout="CodeHighlightOff(this, 'coderef-defCtor');">MyClass::MyClass()</a> constructor is called at line <a href="#coderef-ctor" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-ctor');" onmouseout="CodeHighlightOff(this, 'coderef-ctor');">29</a>.
</li>
</ol>



<p>
  On the other hand, using a C++ compiler such as <code>clang</code> to parse this code and generate an AST
  requires information about the project configuration and its build environment:
</p>
<ol>
<li>The <code>config.h</code> file could be automatically generated by <code>autoconf</code> or <code>CMake</code> and reside in a
     completely different directory than other source files. The compiler will typically need to be
     provided with <code>-I</code> command-line arguments to know where to find header files.

</li>
<li>The <code>DEBUG</code> macro could well be defined by the compilation command line (typically using a <code>-D</code>
     switch).
</li>
</ol>


<p>
  A compiler-based indexing tool thus needs to be aware of the full compilation commands which are
  used to build the project, including for each source file:
</p><ul>
<li>the full list of command-line switches,
</li>
<li>the directory from which the file is compiled.
</li>
</ul>


<p>
  Such information, which we will refer to as a "compilation database" in the following, is usually
  found in the build system configuration, which can take a wide variety of forms: hand-crafted
  <code>Makefile</code>, <code>autotools</code> project, <code>CMake</code> project, <i>etc.</i>
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Features</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   <code>clang-tags</code> aims at providing the following features:
</p><ol>
<li>generate a compilation database in a build-system-agnostic way,
</li>
<li>index the sources of the project,
</li>
<li>use this index to provide IDE-like features in Emacs.
</li>
</ol>



</div>

</div>
