index.org
** First steps for the impatient
    
   All details are explained later, but here are a few steps to get you started if
   you are too impatient to read. Otherwise, you may safely skip to the
   [[*Creating%20the%20compilation%20database][following section]].
    
   1. build the compilation database:
      #+begin_src sh
        ~> cd path/to/your/build/directory
        build> make clean
        build> clang-tags trace make
        [ 33%] Building CXX object CMakeFiles/getopt++.dir/getopt/getopt.cxx.o
        Linking CXX static library libgetopt++.a
        [ 33%] Built target getopt++
        [ 66%] Building CXX object CMakeFiles/clang-tags-def.dir/findDefinition.cxx.o
        Linking CXX executable clang-tags-def
        [ 66%] Built target clang-tags-def
        [100%] Building CXX object CMakeFiles/clang-tags-index.dir/index.cxx.o
        Linking CXX executable clang-tags-index
        [100%] Built target clang-tags-index
      #+end_src
    
   2. index the source files:
      #+begin_src sh
         build> clang-tags index --emacs-conf ../src/
         src/getopt/getopt.cxx...          1.27s.
         src/findDefinition.cxx...         0.34s.
         src/index.cxx...                  0.33s.
      #+end_src
    
   3. find the definition location of the identifier located in =index.cxx= at
      offset 902:
      #+begin_src ct/find-def
         build> clang-tags find-def ../src/index.cxx 902
         -- cursor.location().expansionLocation() -- CallExpr expansionLocation
            src/clang/sourceLocation.hxx:31-51:20-5: CXXMethod expansionLocation
            USR: c:@N@Clang@C@SourceLocation@F@expansionLocation#1
       
         -- cursor.location() -- CallExpr location
            src/clang/cursor.hxx:63-65:20-5: CXXMethod location
            USR: c:@N@Clang@C@Cursor@F@location#1
       
         -- cursor -- DeclRefExpr cursor
            src/index.cxx:21-21:23-40: VarDecl cursor
            USR: c:index.cxx@557@F@indexFile#$@SA@CXCursor#S0_#*v#@cursor
      #+end_src
    
   4. find all uses of the =Cursor::location()= method (identified by its USR, as
      given in the second result of =clang-tags find-def= above):
      #+begin_src grep
         build> clang-tags grep 'c:@N@Clang@C@Cursor@F@location#1'
         src/findDefinition.cxx:13:  const Clang::SourceLocation location(cursor.location());
         src/findDefinition.cxx:33:    const Clang::SourceLocation::Position begin = cursorDef.location().expansionLocation();
         src/findDefinition.cxx:52:  const Clang::SourceLocation location (cursor.location());
         src/findDefinition.cxx:131:    Clang::SourceLocation target = cursor.location();
         src/clang/cursor.hxx:63:    SourceLocation location () const {
         src/index.cxx:34:  const Clang::SourceLocation::Position begin = cursor.location().expansionLocation();
      #+end_src



* Creating the compilation database

  =clang-tags= uses a [[http://clang.llvm.org/docs/JSONCompilationDatabase.html][JSON compilation database]] to get the information needed to correctly build the
  project: compile directories and command-line switches. There are different ways to collect this
  information.

** From a =CMake= project

   =CMake= (since version 2.8.5) supports the generation of a compilation database with the option
   =CMAKE_EXPORT_COMPILE_COMMANDS=. For a =CMake=-managed project, creating the compilation database is
   thus as simple as:
   #+begin_src sh
     cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ../src
   #+end_src


** Tracing the standard build process

   #+begin_src sh
     clang-tags trace -- BUILD COMMAND
   #+end_src

   For non =CMake=-managed projects, there is no "free" way to build the compilation database. One
   way to get the necessary information consists in inspecting the build process as a black box
   using [[http://linux.die.net/man/1/strace][=strace(1)=]] (also see [[https://github.com/rizsotto/Bear][=Bear=]] for a tool using =LD_PRELOAD= to implement the same kind of
   strategy).

   Such a method is inherently independent of the build process: Makefile (possibly
   autotools-generated), shell or python script, ... However, the downside with this approach is
   that =make= and other build systems traditionally only rebuild what's needed, and the generated
   compilation database can thus be incomplete.

   Example usage:
   #+begin_src sh
     make clean                 # Ensure that the whole project will be rebuilt
     clang-tags trace -- make   # Generate the compilation database
   #+end_src


** Scanning the sources directory

   #+begin_src sh
     clang-tags scan SRC_DIR -- CLANG ARGS
   #+end_src

   For relatively simple projects, it can be sufficient to simply scan the top sources directory to
   find all =*.c= or =*.cxx= files, and additionally provide =clang-tags= with a set of command-line
   arguments necessary for =clang= to parse these files.

   Example usage:
   #+begin_src sh
     clang-tags scan ../src -- -I.
   #+end_src


* Indexing the source files

** Creating the index

   #+begin_src sh
   clang-tags index [--emacs-conf SRC_DIR]
   #+end_src

   This command uses the compilation database to index all source files. An
   optional argument =--emacs-conf= allows generating a suitable =.dir-local.el=
   emacs configuration file in the sources directory.

** Updating the index

   #+begin_src sh
   clang-tags update [--all]
   #+end_src

   This command updates the index. With the optional =--all= switch, the
   compilation database is also rebuilt using the same subcommand =trace= or
   =build= as previously.


