index.html

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> First steps for the impatient</h3>
<div class="outline-text-3" id="text-1-2">


<p>    
   All details are explained later, but here are a few steps to get you started if
   you are too impatient to read. Otherwise, you may safely skip to the
   <a href="#sec-2">following section</a>.
</p>
<ol>
<li>build the compilation database:



<pre class="src src-sh">~&gt; cd path/to/your/build/directory
build&gt; make clean
build&gt; clang-tags trace make
[ 33%] Building CXX object CMakeFiles/getopt++.dir/getopt/getopt.cxx.o
Linking CXX static library libgetopt++.a
[ 33%] Built target getopt++
[ 66%] Building CXX object CMakeFiles/clang-tags-def.dir/findDefinition.cxx.o
Linking CXX executable clang-tags-def
[ 66%] Built target clang-tags-def
[100%] Building CXX object CMakeFiles/clang-tags-index.dir/index.cxx.o
Linking CXX executable clang-tags-index
[100%] Built target clang-tags-index
</pre>


</li>
<li>index the source files:



<pre class="src src-sh">build&gt; clang-tags index --emacs-conf ../src/
src/getopt/getopt.cxx...          1.27s.
src/findDefinition.cxx...         0.34s.
src/index.cxx...                  0.33s.
</pre>


</li>
<li>find the definition location of the identifier located in <code>index.cxx</code> at
      offset 902:



<pre class="src src-ct/find-def">build&gt; clang-tags find-def ../src/index.cxx 902
-- <span style="color: #a020f0;">cursor.location().expansionLocation()</span> -- CallExpr expansionLocation
   <span style="color: #ffa500; font-weight: bold; text-decoration: underline;">src/clang/sourceLocation.hxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">31</span><span style="text-decoration: underline;">-</span><span style="color: #a0522d; text-decoration: underline;">51</span><span style="text-decoration: underline;">:</span><span style="color: #228b22; text-decoration: underline;">20</span><span style="text-decoration: underline;">-</span><span style="color: #228b22; text-decoration: underline;">5</span>: CXXMethod expansionLocation
   USR: c:@N@Clang@C@SourceLocation@F@expansionLocation#1

-- <span style="color: #a020f0;">cursor.location()</span> -- CallExpr location
   <span style="color: #ffa500; font-weight: bold; text-decoration: underline;">src/clang/cursor.hxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">63</span><span style="text-decoration: underline;">-</span><span style="color: #a0522d; text-decoration: underline;">65</span><span style="text-decoration: underline;">:</span><span style="color: #228b22; text-decoration: underline;">20</span><span style="text-decoration: underline;">-</span><span style="color: #228b22; text-decoration: underline;">5</span>: CXXMethod location
   USR: c:@N@Clang@C@Cursor@F@location#1

-- <span style="color: #a020f0;">cursor</span> -- DeclRefExpr cursor
   <span style="color: #ffa500; font-weight: bold; text-decoration: underline;">src/index.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">21</span><span style="text-decoration: underline;">-</span><span style="color: #a0522d; text-decoration: underline;">21</span><span style="text-decoration: underline;">:</span><span style="color: #228b22; text-decoration: underline;">23</span><span style="text-decoration: underline;">-</span><span style="color: #228b22; text-decoration: underline;">40</span>: VarDecl cursor
   USR: c:index.cxx@557@F@indexFile#$@SA@CXCursor#S0_#*v#@cursor
</pre>


</li>
<li>find all uses of the <code>Cursor::location()</code> method (identified by its USR, as
      given in the second result of <code>clang-tags find-def</code> above):



<pre class="src src-grep">build&gt; clang-tags grep 'c:@N@Clang@C@Cursor@F@location#1'
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/findDefinition.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">13</span><span style="text-decoration: underline;">:</span>  const Clang::SourceLocation location(cursor.location());
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/findDefinition.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">33</span><span style="text-decoration: underline;">:</span>    const Clang::SourceLocation::Position begin = cursorDef.location().expansionLocation();
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/findDefinition.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">52</span><span style="text-decoration: underline;">:</span>  const Clang::SourceLocation location (cursor.location());
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/findDefinition.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">131</span><span style="text-decoration: underline;">:</span>    Clang::SourceLocation target = cursor.location();
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/clang/cursor.hxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">63</span><span style="text-decoration: underline;">:</span>    SourceLocation location () const {
<span style="color: #00cd00; font-weight: bold; text-decoration: underline;">src/index.cxx</span><span style="text-decoration: underline;">:</span><span style="color: #a0522d; text-decoration: underline;">34</span><span style="text-decoration: underline;">:</span>  const Clang::SourceLocation::Position begin = cursor.location().expansionLocation();
</pre>

</li>
</ol>




</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Creating the compilation database</h2>
<div class="outline-text-2" id="text-2">


<p>
  <code>clang-tags</code> uses a <a href="http://clang.llvm.org/docs/JSONCompilationDatabase.html">JSON compilation database</a> to get the information needed to correctly build the
  project: compile directories and command-line switches. There are different ways to collect this
  information.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> From a <code>CMake</code> project</h3>
<div class="outline-text-3" id="text-2-1">


<p>
   <code>CMake</code> (since version 2.8.5) supports the generation of a compilation database with the option
   <code>CMAKE_EXPORT_COMPILE_COMMANDS</code>. For a <code>CMake</code>-managed project, creating the compilation database is
   thus as simple as:
</p>


<pre class="src src-sh">cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ../src
</pre>



</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Tracing the standard build process</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="src src-sh">clang-tags trace -- BUILD COMMAND
</pre>


<p>
   For non <code>CMake</code>-managed projects, there is no "free" way to build the compilation database. One
   way to get the necessary information consists in inspecting the build process as a black box
   using <a href="http://linux.die.net/man/1/strace"><code>strace(1)</code></a> (also see <a href="https://github.com/rizsotto/Bear"><code>Bear</code></a> for a tool using <code>LD_PRELOAD</code> to implement the same kind of
   strategy).
</p>
<p>
   Such a method is inherently independent of the build process: Makefile (possibly
   autotools-generated), shell or python script, &hellip; However, the downside with this approach is
   that <code>make</code> and other build systems traditionally only rebuild what's needed, and the generated
   compilation database can thus be incomplete.
</p>
<p>
   Example usage:
</p>


<pre class="src src-sh">make clean                 <span style="color: #b22222;"># </span><span style="color: #b22222;">Ensure that the whole project will be rebuilt</span>
clang-tags trace -- make   <span style="color: #b22222;"># </span><span style="color: #b22222;">Generate the compilation database</span>
</pre>



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Scanning the sources directory</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="src src-sh">clang-tags scan SRC_DIR -- CLANG ARGS
</pre>


<p>
   For relatively simple projects, it can be sufficient to simply scan the top sources directory to
   find all <code>*.c</code> or <code>*.cxx</code> files, and additionally provide <code>clang-tags</code> with a set of command-line
   arguments necessary for <code>clang</code> to parse these files.
</p>
<p>
   Example usage:
</p>


<pre class="src src-sh">clang-tags scan ../src -- -I.
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Indexing the source files</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Creating the index</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="src src-sh">clang-tags index [--emacs-conf SRC_DIR]
</pre>


<p>
   This command uses the compilation database to index all source files. An
   optional argument <code>--emacs-conf</code> allows generating a suitable <code>.dir-local.el</code>
   emacs configuration file in the sources directory.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Updating the index</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="src src-sh">clang-tags update [--all]
</pre>


<p>
   This command updates the index. With the optional <code>--all</code> switch, the
   compilation database is also rebuilt using the same subcommand <code>trace</code> or
   <code>build</code> as previously.
</p>

</div>
</div>

</div>
