index.org
* Using the Emacs UI

First, load the package using =M-x load-file RET path/to/clang-tags.el RET=

With the configuration file generated by the =clang-tags index= command, all
C/C++ source files in the indexed source directory should automatically activate
=clang-tags-mode= and have the =ct/default-directory= variable point to the
index directory.


** Find the definition of the symbol at point

While in a source buffer, you can use =clang-tags= to find the location of the definition
of the symbol under point by pressing =M-<dot>=.

The list of relevant definitions is presented in a buffer, where pressing =RET= will take you to the
location of the definition.

** Find all uses of a definition in the source base

After having looked for a definition of the symbol under point, and while in the definitions list
buffer, press =M-<comma>= to list all uses of the current definition in the source code base.

Results are presented in a =grep-mode= buffer.


* See also

- [[http://clang.llvm.org/doxygen/group__CINDEX.html][libclang API documentation]]
- [[http://llvm.org/devmtg/2010-11/Gregor-libclang.pdf][Doug Gregor's presentation on libclang]]
- [[https://github.com/drothlis/clang-ctags][clang-ctags]]: a similar project
  using libclang to generate =ctags= / =etags= index files.
