index.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Using the Emacs UI</h2>
<div class="outline-text-2" id="text-4">


<p>
First, load the package using <code>M-x load-file RET path/to/clang-tags.el RET</code>
</p>
<p>
With the configuration file generated by the <code>clang-tags index</code> command, all
C/C++ source files in the indexed source directory should automatically activate
<code>clang-tags-mode</code> and have the <code>ct/default-directory</code> variable point to the
index directory.
</p>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Find the definition of the symbol at point</h3>
<div class="outline-text-3" id="text-4-1">


<p>
While in a source buffer, you can use <code>clang-tags</code> to find the location of the definition
of the symbol under point by pressing <code>M-&lt;dot&gt;</code>.
</p>
<p>
The list of relevant definitions is presented in a buffer, where pressing <code>RET</code> will take you to the
location of the definition.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Find all uses of a definition in the source base</h3>
<div class="outline-text-3" id="text-4-2">


<p>
After having looked for a definition of the symbol under point, and while in the definitions list
buffer, press <code>M-&lt;comma&gt;</code> to list all uses of the current definition in the source code base.
</p>
<p>
Results are presented in a <code>grep-mode</code> buffer.
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> See also</h2>
<div class="outline-text-2" id="text-5">


<ul>
<li><a href="http://clang.llvm.org/doxygen/group__CINDEX.html">libclang API documentation</a>
</li>
<li><a href="http://llvm.org/devmtg/2010-11/Gregor-libclang.pdf">Doug Gregor's presentation on libclang</a>
</li>
<li><a href="https://github.com/drothlis/clang-ctags">clang-ctags</a>: a similar project
  using libclang to generate <code>ctags</code> / <code>etags</code> index files.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
Generated by <a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23 using CSS stylesheets from <a href='http://www.orgmode.org/worg'>Worg</a>.
</div>
</body>
</html>
